app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "due", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "clean"], ["due", "2018-02-15"], ["note", "Just do it!"], ["created_at", "2018-01-26 08:28:47.101515"], ["updated_at", "2018-01-26 08:28:47.101515"]]

  def check
    if @list.finished == false
      @list.update_attribute(:finished, true)
---
UPDATE "lists" SET "finished" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["finished", "f"], ["updated_at", "2018-01-29 07:33:21.050188"], ["id", 1]]